# questions.py

# Формат: {"Тема": [{"вопрос": "...", "ответ": "..."}, ...]}
QUESTIONS = {
    "История": [
        {"вопрос": "Когда произошло Крещение Руси?", "ответ": "988 год"},
        {"вопрос": "Кто был первым царём России?", "ответ": "Иван IV Грозный"}
    ],
    "Право": [
        {"вопрос": "Что такое коррупция по ФЗ-273?", "ответ": "Злоупотребление должностным положением в целях личной выгоды"},
        {"вопрос": "Кто утверждает Национальный план противодействия коррупции?", "ответ": "Президент РФ"}
    ],
    "Экономика": [
        {"вопрос": "Что изучает микроэкономика?", "ответ": "Поведение отдельных экономических агентов"}
    ]
}